### Exploratory Data Analysis ~ EDA
EDA is an approach to analyse the given data sets by summerizing their main characteristics with visualisations.

Prerequisites:
1. Python Programming Language (Pandas and Numpy)
2. Mathematics

In [1]:
import pandas as pd
# pandas is a python library to deal with datasets (DataFrames and Series)

In [2]:
import numpy as np
# numpy stands for numeric python

In [3]:
import matplotlib.pyplot as plt

#matplotlib is a python library to plot a dataset in form of various graphs and visual informations.

In [4]:
df = pd.read_csv('chitest.csv', encoding = 'utf-8')

#here we read chitest.csv file using pandas library (csv files are comma seperated values) and made a dataframe called "df".

In [5]:
print(df)

#print statement prints the dataframe in a different manner as compared to the below visual shows.

   Gender Like Shopping?
0    Male             No
1  Female            Yes
2    Male            Yes
3  Female            Yes
4  Female            Yes
5    Male            Yes
6    Male             No
7  Female             No
8  Female             No

In [6]:
df

#dataframe

   Gender Like Shopping?
0    Male             No
1  Female            Yes
2    Male            Yes
3  Female            Yes
4  Female            Yes
5    Male            Yes
6    Male             No
7  Female             No
8  Female             No

In [7]:
contingency_table = pd.crosstab(df['Gender'], df['Like Shopping?'])
contingency_table

#crosstab is pandas functionality that accumulates the unique data in form of rows and columns and gives the corresponding values.

Like Shopping?  No  Yes
Gender
Female           2    3
Male             2    2

In [8]:
from scipy import stats

#SciPy is a scientific library in python and basically a extension to numpy to perform more complex calculations in less time.

observed_values = contingency_table.values

# dataFrame.values return numpy representation of the dataset

print('Observed Values : ',observed_values)

b = stats.chi2_contingency(contingency_table)

Expected_table = b[3]

Expected_table

Observed Values :  [[2 3]
 [2 2]]

array([[2.22222222, 2.77777778],
       [1.77777778, 2.22222222]])

In [9]:
bd = pd.read_csv('bank.csv',sep = ';')
bd.head(10)
# We can pass argument in df.read(x), x will be the number of rows you want to see in output.
# Read a bank.csv file, we will be applying Data Analysis on this file.

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [10]:
bd['contact'].unique()

# bd['Column_Name'].unique() return the unique values in that particular column in form of a numpy array.

array(['unknown', 'cellular', 'telephone'], dtype=object)

In [11]:
bd.info()

#df.info() returns the column names there non-null count and data type as you can see in the output.

bd.describe()

#df.describe() returns statistics related to the dataframe like standard deviation,  mean, count, min, max of a particular column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [12]:
bd.shape

#it outputs the number of rows per number of coulmns in a tuple form.

(45211, 17)

In [13]:
bd.columns.tolist()

#this returns a column list

['age',
 'job',
 'marital',
 'education',
 'default',
 'balance',
 'housing',
 'loan',
 'contact',
 'day',
 'month',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'poutcome',
 'y']

In [14]:
bd.age.unique()

#df.Column_name == df.['Column_name'] .unique() returns unique values in that particular column in form of an numpy array.

array([58, 44, 33, 47, 35, 28, 42, 43, 41, 29, 53, 57, 51, 45, 60, 56, 32,
       25, 40, 39, 52, 46, 36, 49, 59, 37, 50, 54, 55, 48, 24, 38, 31, 30,
       27, 34, 23, 26, 61, 22, 21, 20, 66, 62, 83, 75, 67, 70, 65, 68, 64,
       69, 72, 71, 19, 76, 85, 63, 90, 82, 73, 74, 78, 80, 94, 79, 77, 86,
       95, 81, 18, 89, 84, 87, 92, 93, 88])

In [15]:
bd.age.nunique()

#df.Column_name.nunique() returns number of unique value present in that particular column.

77

In [16]:
bd.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [17]:
bd.marital.unique()

array(['married', 'single', 'divorced'], dtype=object)

In [18]:
bd.education.unique()

array(['tertiary', 'secondary', 'unknown', 'primary'], dtype=object)

In [21]:
bd.isnull().sum()

# df.isnull() returns a boolean value corresponding to a particular row and column, 
# while if we use df.isnull().sum(), it returns number of null values count in a particular column.

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [22]:
bd.dtypes

# df.dtypes returns the data type of a all colums in a single frame.

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

Next we will be covering seaborn library in python, it is used widely in field of Machine Learning

More updates will be there in coming days...